'''
1. Вычислить число Pi c заданной точностью *d*

    *Пример:*
    - при d = 0.001, π = 3.141


2. Задайте натуральное число N. Напишите программу,
которая составит список простых множителей числа N.

  24 -> 2 2 2 3
 
3. Задайте последовательность чисел. 
   Напишите программу, которая выведет список неповторяющихся 
    элементов исходной последовательности.

    [1, 1, 1, 2, 2, 3, 5, 4, 4, 7, 8, 8, 7] -> [3, 5]
4. Задана натуральная степень k. 
   Сформировать случайным образом список коэффициентов 
   (значения от 0 до 100) многочлена и записать в файл многочлен 
   степени k.

    *Пример:*

    - k=3 => 2*x**3 + 2*x**2 + 4*x + 5 = 0 или x**3 + 5 = 0 или 10*x**2 = 0


5. Даны два файла, в каждом из которых находится запись многочлена. 
   Задача - сформировать файл, содержащий сумму многочленов.

6 5x^6 + 2x^4 + 66
15x^6 + 12x^5 + 33x^2 - 66

2*x**3 + 5*x - 3

5*x**2 - 2*x + 4

2*x**3 + 5*x**2 + 3*x + 1
'''