'''3. Напишите программу, в которой пользователь будет задавать две строки,    а программа - определять количество вхождений одной строки в другой.s1 = 'aa ab aba ewfwef's2 = 'aba'print(s1.count(s2))'''print('Введите первую строку: ')string_1 = input()print('Введите вторую строку: ')string_2 = input()count = 0for i in range(len(string_1) - (len(string_2) - 1)):    if string_1[i:i+len(string_2)] == string_2:        count+= 1print(count)