'''1. Задайте строку из набора чисел. Напишите программу,    которая покажет большее и меньшее число.    В качестве символа-разделителя используйте пробел.'''string = input('Введите цифры через пробел: ').split()bigger = minimal = int(string[0])for i, v in enumerate(string, start= 1):    if bigger < int(v):        bigger = int(v)    if minimal > int(v):        minimal = int(v)print(f'Наибольшее число: {bigger}.\nНаименьшее число: {minimal}.')